{
  "banner_head_title": "NATIONAL INSTITUTE OF TECHNOLOGY JAMSHEDPUR",
  "banner_head_lead": "We are leader in Education since 1960.",
  "vision_home_head": "Our Vision",
  "vision_home": "To be one of the premier technical institutions for its academic excellence and innovative research to meet the future needs of the society.",




"commentsk": "below is Shashank's Work"

,"about_nitjsr":"About NITJSR"
,"heading_institute": "Institute"
,"head_about_nitjsr":"About NITJSR"
,"head_vision":"Vision And Mission"
,"head_acts":"Acts And Statues"
,"head_board_of_governers":"Board Of Governers"
,"head_finance_committee":"Finance Committee"
,"head_building_and_work":"Buildings And Works Committee"
,"head_senate":"Senate"
,"head_ranking_and_recognition":"Ranking And Recognition"





,"heading_about_us":"About Us"
,"about_us_para":"National Institute of Technology, Jamshedpur,earlier known as Regional Institute of Technology was established on 15th August 1960 as a joint venture of Government of India and the Government of Bihar in the chain of REC's (Regional Engineering College) in India with the aim to generate technical graduates of highest standards who could provide technological leadership to the region. It was among the first eight Regional Engineering Colleges (RECs) established as part of the Second Five-Year Plan (1956 - 1961). This was the only REC in the country which was named as RIT (Regional Institute of Technology). Therefore RIT Jamshedpur was actually the REC of undivided Bihar & Jharkhand. The foundation stone of RIT (REC) Jamshedpur was laid by Dr. Srikrishna Sinha, the then chief minister of Bihar , with the aim of nurturing talent and setting high standards of education and excellence. On 27th December 2002, in the line of all other RECs of India, RIT Jamshedpur (may be read as REC Jamshedpur too) was converted to National Institute of Technology, Jamshedpur with the status of a Deemed University as per the decision of Govt. of India. The Institute is fully funded and governed by the Ministry of Human Resource Development (MHRD), Government of India since 1st April, 2003. On 15 August 2007, NIT Jamshedpur was given the status of the Institute of National Importance through an Act of the Parliament known as the NIT Act. The Institute has 12 departments including engineering, science and humanities. The Institute, with 200 faculty, 4000 students, 150 administrative and supporting staff, is a self-contained campus. It is located on the outskirts of Jamshedpur on 341.3 acres of sprawling, rolling hilly, wooded land. It combines natural beauty of countryside with urban glamour of an industrial area. The flowing river and picturesque backdrop of low hills on one side and large tracks of forest on the other make the campus an ideal place for higher learning and research. It has been growing from strength to strength ever since it was established in 1960. Situated in the heart of the rich mineral and industrial belt of Jharkhand State, the campus encompasses the Main building, the Library, the Computer Center, 13 hostels (9 Boys hostels and 4 Girls hostels), staff quarters, Guest House, a Students Gymkhana, a Post-office , a branch of State Bank of India, two ATMs, central store and a dispensary. The hostels and departments are connected with high speed wireless LAN. The institute maintains courts for basketball, volleyball, badminton and tennis. Apart from this, it also has cricket, hockey and football grounds. The institute is poised for bright and promising future. The courses have been completely restructured and prepared as per the needs of society and industries. There is refreshing development on every front. The institute has achieved impressive placement for its students, with top industrial houses and software companies recruiting the students in large numbers."
,"head_location":"Location"
,"location_para":"NIT Jamshedpur is situated in the western part of the city Jamshedpur , which is in the southern end of the state of Jharkhand and is bordered by the states of Orissa and West Bengal. It is just far enough to ensure that the city with its noise is too distant to distract and just near enough to guarantee that all city facilities are immediately available. The institute is strategically located with the unique advantage of being surrounded by giant and medium scale industries like Tata-Steel, Telco, Indian Steel Wire Products, Tata Tubes, Tinplate Company, Tata Timken etc. and reputed Institutes like the National Metallurgical Laboratory, Xavier Labour Relations Institute and National Institute of Foundry and Forge Technology, Ranchi.Click here to view how to reach here."
,"head_history":"History"
,"history_para":"NIT, Jamshedpur was formally inaugurated on 15th August 1960 at Adityapur, Jamshedpur by Dr. Srikrishna Sinha, the then and also the first Chief Minister of Bihar and the first Chairman of the Board of Governors of RIT, Jamshedpur. His eloquent speech highlighted the dreams and aspirations to be nurtured by the institute to achieve excellence in higher technical education, research and development. This inaugural address was termed 'the first lecture' in Humanities by the founder Principal Dr. R. P. Verma. It is noteworthy that both the founder Chairman and the founder Principal happened to be freedom fighters. Their nationalistic fervour and passion for progress set the college moving on the right path towards technological development. The historical day at RIT, Jamshedpur was 27th December, 2002 when it was formally upgraded to National Institute of Technology, Jamshedpur with the Deemed University status. R.I.T., Jamshedpur started off by offering undergraduate courses in four branches (viz Civil, Electrical, Mechanical and Metallurgy) of Engineering in 1960. The institute also offers M.Tech, Ph. D., Non-Formal B. Sc. Engineering Programme and MCA programmes."


,"heading_our_vision":"Our Vission"
,"our_vision_para":"To be one of the premier technical institutions for its academic excellence and innovative research to meet the future needs of the society."
,"heading_our_mission":"Our Mission"
,"our_mission_para":"To build conducive environment for learning and creativity. To train students to become technically competent professionals and socially responsible citizens. To develop innovative products and technologies for the betterment of the society."


,"heading_acts_and_statues":"Acts and Statues"


,"heading_board_of_members":"Members"
,"head_ex_chairman":"Ex-Officio Chairman"
,"subhead_ex_chairman":"Prof. Karunesh Kumar Shukla(Director)"
,"ex_chairman_details":"Director, National Institute of technology Jamshedpur"

,"head_senate_nominee":"Senate Nominee"
,"subhead_senate_nominee":"Prof. A.K.L.Srivastava  &  Dr. Uday Kumar"

,"head_NIT_Council_Nominee":"NIT Council Nominee"
,"subhead_NIT_Council_Nominee":"Dr. Savita Mishra"

,"head_NIT_Council_Member":"NIT Council Member"
,"subhead_NIT_Council_Member":"Mr. Bhanu Prakash Jalan"

,"head_MHRD_New_Delhi":"MHRD,New Delhi"
,"subhead_MHRD_New_Delhi":"JS & FA(MHRD, New Delhi)  &  JS(MHRD, New Delhi)"

,"head_members":"Members"
,"subhead_member1":"Professor Pushpak Bhattacharyya"
,"member1_details":"Director, IIT Patna"

,"subhead_member2":"Professor D.K. Singh"
,"member2_details":"Director, BIT Sindri"

,"subhead_member3":"Director"
,"member3_details":"Department of Higher and Technical Education,Govt. of Jharkhand"

,"heading_secretary":"Secretary"
,"subheading_secretary":"Colonel Nisheeth Kumar Rai (Retd.)"

,"heading-min_of_meet":"Minutes of Meetings"






,"commentsk2":"above is shashank's work"




}